src/cf/Documents/ФормированиеУставногоКапитала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ФормированиеУставногоКапитала</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УставныйКапиталДоИзменения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УставныйКапитал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СформированПомощникомРегистрации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменениеУставногоКапитала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРегистрации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Учредители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипУчредителя</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Учредитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзносаДоИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзноса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставительУчредителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностьПредставителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставительНаОсновании</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ФормированиеУставногоКапитала/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ЗначениеЗаполнено(Организация)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮридическоеФизическоеЛицо") 
			= Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		Организация = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УставныйКапиталДоИзменения = Учредители.Итог("СуммаВзносаДоИзменения");
	УставныйКапитал            = Учредители.Итог("СуммаВзноса");
	
	Если СформированПомощникомРегистрации Тогда
		Для каждого СтрокаТаблицы Из Учредители Цикл
			Если СтрокаТаблицы.ТипУчредителя = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
				СтрокаТаблицы.Контрагент = СтрокаТаблицы.Учредитель;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ИзменениеУставногоКапитала Тогда
		Для Каждого СтрокаТаблицы Из Учредители Цикл
			СтрокаТаблицы.СуммаВзносаДоИзменения = 0;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	НепроверяемыеРеквизиты.Добавить("УставныйКапиталДоИзменения");
	НепроверяемыеРеквизиты.Добавить("УставныйКапитал");
	НепроверяемыеРеквизиты.Добавить("Учредители.ПредставительУчредителя");
	НепроверяемыеРеквизиты.Добавить("Учредители.ДолжностьПредставителя");
	НепроверяемыеРеквизиты.Добавить("Учредители.ПредставительНаОсновании");
	Если НЕ СформированПомощникомРегистрации Тогда
		НепроверяемыеРеквизиты.Добавить("Учредители.Учредитель");
		НепроверяемыеРеквизиты.Добавить("Учредители.ТипУчредителя");
	Иначе
		НепроверяемыеРеквизиты.Добавить("Учредители.Контрагент");
		Для Индекс = 0 По Учредители.Количество() - 1 Цикл
			СтрокаТаблицы = Учредители[Индекс];
			НомерСтроки   = Формат(Индекс + 1, "ЧГ=");
			ИмяСписка     = "Учредители";
			ПутьКСтроке   = "Объект" + "." + ИмяСписка + "[" + Формат(Индекс, "ЧГ=") + "].";
			Если СтрокаТаблицы.ТипУчредителя = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
				// Представитель учредителя
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ПредставительУчредителя) Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
						"Колонка", , НСтр("ru = 'Представитель'"), НомерСтроки, ИмяСписка);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, 
						Ссылка, ПутьКСтроке + "ПредставительУчредителя", , Отказ);
				КонецЕсли;
				// Должность представителя
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДолжностьПредставителя) Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
						"Колонка", , НСтр("ru = 'Должность представителя'"), НомерСтроки, ИмяСписка);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, 
						Ссылка, ПутьКСтроке + "ДолжностьПредставителя", , Отказ);
				КонецЕсли;
				// Основание полномочий представителя
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ПредставительНаОсновании) Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
						"Колонка", , НСтр("ru = 'На основании'"), НомерСтроки, ИмяСписка);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, 
						Ссылка, ПутьКСтроке + "ПредставительНаОсновании", , Отказ);
				КонецЕсли;
			Иначе
				// Контрагент, соответствующий физическому лицу.
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Контрагент) Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
						"Колонка", , НСтр("ru = 'Контрагент'"), НомерСтроки, ИмяСписка);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, 
						Ссылка, ПутьКСтроке + "Контрагент", , Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если СформированПомощникомРегистрации
		И ИзменениеУставногоКапитала Тогда
		НепроверяемыеРеквизиты.Добавить("Учредители.СуммаВзноса");
	КонецЕсли;
	
	// Уставный капитал
	МинимальныйУставныйКапитал = РегистрацияОрганизацииКлиентСервер.МинимальныйУставныйКапитал();
	Если Учредители.Количество() > 0
		И Учредители.Итог("СуммаВзноса") < МинимальныйУставныйКапитал Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Уставный капитал не может быть меньше %1 руб.'"),
			Формат(МинимальныйУставныйКапитал, "ЧДЦ="));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "Объект.Учредители", , Отказ);
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ПараметрыПроведения = Документы.ФормированиеУставногоКапитала.ПодготовитьПараметрыПроведения(
		Ссылка, 
		Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаИзмененияУставногоКапитала = Документы.ФормированиеУставногоКапитала.ПодготовитьТаблицуИзмененияУставногоКапитала(
		ПараметрыПроведения.Реквизиты, ПараметрыПроведения.Учредители);
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	Документы.ФормированиеУставногоКапитала.СформироватьПроводки(
		ПараметрыПроведения.Реквизиты,
		ТаблицаИзмененияУставногоКапитала,
		Движения, 
		Отказ);
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
